Revit 2027 API
DeleteElements.Create(Document, ISet<ElementId>) Method
 Creates an instance of the DeleteElements resolution.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureResolution Create(
	Document document,
	ISet<ElementId> ids
)
Public Shared Function Create (
	document As Document,
	ids As ISet(Of ElementId)
) As FailureResolution
public:
static FailureResolution^ Create(
	Document^ document,
	ISet<ElementId^>^ ids
)
static member Create :
        document : Document *
        ids : ISet<ElementId> -> FailureResolution
Parameters
document Document
 The document which owns the elements to delete.
ids ISet<ElementId>
 The ids of the elements that will be deleted when this resolution is chosen.
Return Value
FailureResolution
 The instance of the DeleteElements resolution.
Exceptions
Exception | Condition
ArgumentException |  The input ids is empty or contains an invalid element id.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DeleteElements Class
Create Overload
Autodesk.Revit.DB Namespace